## Create a dataframe

In [1]:
import pandas as pd

In [2]:
# dictionary with list object in values
details = {
    'Name' : ['Ankit', 'Aishwarya', 'Shaurya','Shivangi'],
    'Age' : [23, 21, 22,21],
    'University' : ['BHU', 'JNU', 'DU', 'BHU'],
}

In [5]:
df = pd.DataFrame(details, index = ['a', 'b', 'c', 'd'])

In [6]:
df

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU
c    Shaurya   22         DU
d   Shivangi   21        BHU

## Delete a single row in a dataframe by row index label

In [9]:
new_df = df.drop('c')

In [10]:
new_df

        Name  Age University
a      Ankit   23        BHU
b  Aishwarya   21        JNU
d   Shivangi   21        BHU

## Example #2: Delete Multiple Rows in DataFrame by Index Labels

In [11]:
new_df = df.drop(['b', 'd'])

In [12]:
new_df

      Name  Age University
a    Ankit   23        BHU
c  Shaurya   22         DU

## Example #3: Delete a Multiple Rows by Index Position in DataFrame

In [16]:
new_df = df.drop([df.index[1], df.index[2]])

print(new_df)

       Name  Age University
a     Ankit   23        BHU
d  Shivangi   21        BHU